Catalogs/КалькуляторПланаВознаграждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>КалькуляторПланаВознаграждения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
				<xr:Item>Document.ПланВознагражденияПосредника</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Посредник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КалькуляторПланаВознаграждения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область РаспределениеСуммыДокумента

&НаСервере
Функция ЗаполнитьПоЗадачеПроекта_НаСервере(ЗадачаПроекта)
	Если ЗначениеЗаполнено( ЗадачаПроекта ) Тогда
		// чистим полюбому
		Документ = РеквизитФормыВЗначение("Объект");
		Документ.Начисления.Очистить();
		
		СуммаПоЗадаче = ЗадачаПроекта.ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
		Если СуммаПоЗадаче <> 0 И Документ.СуммаДокумента <> 0 Тогда
			мК = ЗадачаПроекта.ЭтапыГрафикаОплаты.ВыгрузитьКолонку("СуммаПлатежа");
		
			мСумм 	= РаспределитьПропорционально( Документ.СуммаДокумента, мК, 2 );
			Индекс 	= 0;
			Для Каждого Сумма ИЗ мСумм Цикл
				Стр = Документ.Начисления.Добавить();
				//Начисление					= Документ.Начисления[Индекс];
				
				Стр.ДатаНачисления 	= ЗадачаПроекта.ЭтапыГрафикаОплаты[Индекс].ДатаПлатежа;
				Стр.Сумма 			= Сумма;
				Индекс	= Индекс + 1;
			КонецЦикла;
		КонецЕсли;
		ЗначениеВРеквизитФормы(Документ, "Объект");
	
		Возврат Истина;
		
	
	Иначе
	    Возврат Ложь;
		
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоЗадачеПроекта(Команда)
	ЭтаФорма.Модифицированность = ЗаполнитьПоЗадачеПроекта_НаСервере( Объект.ЗадачаПроекта );
КонецПроцедуры


&НаСервере
Функция РаспределитьСуммуПоДатамНаСервере()
	Документ = РеквизитФормыВЗначение("Объект");
	
	// нет ни одной строки
	Если Документ.Начисления.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	// очищаем распределение
	Если Документ.СуммаДокумента = 0 
	или  Документ.Начисления.Итог("Сумма") =0	Тогда
		Документ.Начисления.Очистить();
		
	Иначе
	// распределяем
		мК 		= Документ.Начисления.ВыгрузитьКолонку( "Сумма");
		мСумм 	= РаспределитьПропорционально( Документ.СуммаДокумента, мК, 2 );
		Индекс 	= 0;
		Для Каждого Сумма ИЗ мСумм Цикл
			Начисление					= Документ.Начисления[Индекс];
			Индекс	= Индекс + 1;
			
			Начисление.Сумма 			= Сумма;
		КонецЦикла;
		
	КонецЕсли;
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	Возврат Истина;
		
	
КонецФункции


// РАаспределить сумму документа (изменившуюся) по датам, установленным в начислениях, без изменения дат
&НаКлиенте
Процедура РаспределитьСуммуПоДатам(Команда)
	ЭтаФорма.Модифицированность = РаспределитьСуммуПоДатамНаСервере();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиФормы

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаПоЗадачеПроекта(ЗадачаПроекта)
	Возврат УП_ПланыРаботПоПроектам.КонтрагентЗадачиПроекта( ЗадачаПроекта );
КонецФункции

&НаКлиенте
Функция УстановитьКонтрагента()
	Контрагент =ПолучитьКонтрагентаПоЗадачеПроекта( Объект.ЗадачаПроекта)
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчетСуммыДокумента();
	УстановитьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаПроектаПриИзменении(Элемент)
	УстановитьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммыДокумента()
	Объект.СуммаДокумента = Объект.Начисления.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСуммаПриИзменении(Элемент)
	ПересчетСуммыДокумента();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено( Объект.ЗадачаПроекта ) Тогда
		Сообщить("Документ создается на основании задачи проекта");
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

КонецПроцедуры



#КонецОбласти
